# **Handling Missing Data**

## Missing Data in Pandas

### None as a Sentinel Value

None is a python object dtype with dont suit arthimetic operations or speed

In [1]:
import numpy as np
import pandas as pd

arr = np.array([1, None, 2, 3])
arr # object dtype

array([1, None, 2, 3], dtype=object)

In [2]:
%timeit np.arange(1E6, dtype=int).sum()

1.4 ms ± 32.1 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [3]:
%timeit np.arange(1E6, dtype=object).sum()

43.2 ms ± 1.1 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [4]:
# arr.sum()  # error

### NaN: Missing Numerical Data

In [5]:
arr = np.array([1, np.nan, 3, 4])
arr # standard IEEE floating point

array([ 1., nan,  3.,  4.])

In [6]:
1 + np.nan

nan

In [7]:
0 * np.nan

nan

In [8]:
arr.sum()

nan

In [9]:
# ignore nan
np.nansum(arr)  # 1 + 3 + 4

8.0

### NaN and None in Pandas

In [10]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [11]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int32

In [12]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

### Pandas Nullable Dtypes

In [13]:
pd.Series([1, np.nan, 2, None, pd.NA], dtype="Int32")

0       1
1    <NA>
2       2
3    <NA>
4    <NA>
dtype: Int32

## Operating on Null Values

### Detecting Null Values

masking methods isnull | notnull return a boolien mask

In [14]:
data = pd.Series([1, np.nan, "hello", None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

we can use it as a dataframe index

In [15]:
data[data.notnull()]

0        1
2    hello
dtype: object

### Dropping Null Values

a copy that doesnt contains none values

In [16]:
data.dropna()

0        1
2    hello
dtype: object

In [17]:
df = pd.DataFrame(
    [
        [1, np.nan, 2],
        [2, 3, 5],
        [np.nan, 4, 6],
    ]
)
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

by default it will drop all rows that contains null

In [18]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [19]:
# df.dropna(axis=1)
df.dropna(axis="columns")

   2
0  2
1  5
2  6

**how** arg: the way to drop between default any | all<br>
**any:** any null value will cause drop all row or column.<br>
**all:** to drop rows with all items is null.

In [20]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [21]:
df.dropna(axis="columns", how="all")

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

**thresh:** min num of not-null values to keep

In [22]:
df.dropna(axis="rows", thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

### Filling Null Values

**fillna():** returns a copy of the array with the null values replaced.

In [23]:
data = pd.Series(
    [1, np.nan, 2, None, 3],
    index=list("abcde"),
    dtype="Int32",
)
data

a       1
b    <NA>
c       2
d    <NA>
e       3
dtype: Int32

In [24]:
data.fillna(0)

a    1
b    0
c    2
d    0
e    3
dtype: Int32

In [25]:
# forward fill (ffill)
data.ffill()

a    1
b    1
c    2
d    2
e    3
dtype: Int32

In [26]:
# backward fill (bfill)
data.bfill()

a    1
b    2
c    2
d    3
e    3
dtype: Int32

In [27]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [28]:
df.ffill(axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0